[
  {
    "path": "posts/2021-12-30-z-nowym-rokiem-nowym-krokiem/",
    "title": "Z Nowym Rokiem, nowym krokiem",
    "description": "\"Dawno\" to słowo, ktore nie lubię, bo \"dawno\" nic nie pisałem na blogu, bo \"dawno\" postanowiłem, że zmienię silnik. Było to tak dawno, że \"dawno\" zapomniałem, że chciałem zmienić silnik.",
    "author": [
      {
        "name": "Staś",
        "url": {}
      }
    ],
    "date": "2021-12-30",
    "categories": [],
    "contents": "\nZacznijmy od tego: stali bywalcy, tak, tak, są tacy, mimo, że ponad rok nic nie pisałem, mogą być zdziwieni. Blog istnieje ho, ho i trochę. Było na nim kilkaset wpisów, a teraz ledwie 3? O co kaman?\n\nJuż tłumaczę. Dawno bo jakieś dwa lata temu postanowiłem, że zmienię silnik bloga. Nie chodziło o jakieś ekstrasy, tylko o wygodę. Używany przeze mnie wówczas Blogdown ma wiele zalet, ale jedną wadę: jeśli wpisy zawierają kod, a biblioteki wykorzystywane w kodzie się zmieniają, to często jest tak, że przez błąd w jednym artykule, cały blog “wisi”, bo nie można wygenerować pozostałych.\nTrochę to było denerwujące i wtedy natrafiłem na Distill, bajecznie prosty, ale niezwykle miły w zarządzaniu blog. Oczywiście napisany w R. No i zakochałem się.\nSamo jego postawienie jest bajecznie proste, ale problemy zaczęły być przy migracji postów z poprzedniej instancji. Najpierw odwlekałem by się za to wziać, a potem już wiedziałem co zrobić, ale zawsze była jakaś “maniana” i nie stawiałem. Nie będę tłumaczył dlaczego, bo pewnie mało to kogo interesuje, ale postanowiłem, że postawię bloga jak jest, dodam kilka notek z archiwum, a kolejne będę sukcesywnie dodawał. Tak zrobiłem, no i jest mój stary-nowy blogasek :-)\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-02T23:07:40+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-03-07-wieczr-emocji-duda-vs-kurski-i-co-si-z-tego-dowiedziaem-o-dziennikarzach-i-serwisach-informacyjnych/",
    "title": "Wieczór emocji: Duda vs. Kurski i co się z tego dowiedziałem o dziennikarzach i serwisach informacyjnych?",
    "description": {},
    "author": [
      {
        "name": "Staś",
        "url": {}
      }
    ],
    "date": "2020-03-07",
    "categories": [],
    "contents": "\n6 marca na pewno długo będzie zapamiętany zarówno przez prezydenta Andrzeja Dudę jak i dziennikarzy. W ten właśnie wieczór, dosłownie na godzinę przed upłynięciem ustawowego terminu, Duda podpisał ustawę dofinansowującą publiczną TVP. Wcześniej, po głównym wydaniu “Wiadomości” w wywiadzie, Jacek Kurski, prezes TVP oddał się do dyspozycji…Prezydenta. Dziwne, bo prezydent nie mianuje prezesa TVP (robi to Rada Mediów Narodowych). Podejrzewałem, że te kilka wydarzeń, wywoła emocje wśród dziennikarzy i postanowiłem to sprawdzić. Gdzie? Najlepiej na Twitterze. Pobrałem z Twittera dwa rodzaje tweetów:\ntweety (bez retweetów) opublikowane w dniach 6-7 marca 2020, przez dziennikarzy (na bazie mojej listy dziennikarzy) w których wspomnieli jakiekolwiek konto na Twitterze. Czyli np. Redaktor Iksiński w tweecie wspomina konto Kowalskiego.\nopublikowane w dniach 6-7 marca 2020 tweety w których znajdowały się linki do artykułów z 10 najpopularniejszych serwisów informacyjnych: wiadomosci.onet.pl, fakty.interia.pl, wiadomosci.wp.pl, wyborcza.pl/7,75398, wyborcza.pl/7,75399, tvp.info, tvn24.pl/polska, tvn24.pl/swiat, wiadomosci.gazeta.pl, wiadomosci.radiozet.pl, www.fakt.pl/wydarzenia, www.se.pl/wiadomosci/.\nDobór serwisów dokonałem na podstawie rankingu Megapanelu ze stycznia w kategorii serwisów informacyjno - publicystycznych, ale dokonałem jednej zmiany. Zmiana to zastąpienie znajdującego się w rankingu serwisu NaTemat.pl przez TVP.info. Wynikała ona z dwóch faktów: serwis NaTemat nie ma wydzielonej sekcji z newsami. Niby jest “Dzieje się”, ale to oprócz newsów, również artykuły o innej tematyce. Taki gulasz. Po drugie, chciałem zbadać jak często przesyłane są linki z TVP.info, który z pewnością jest jedną ze stron sporu.\nZebrane dane posłużyły mi do różnych analiz, ale tu ograniczę się do pokazania grafów, z których można odczytać wiele ciekawych informacji. Zacznijmy od grafa, który powstał z tweetów w których znajdował się link do 10 wybranych serwisów informacyjnych. Dzięki niemu zobaczymy:\nranking serwisów wg. popularności rozumianej jako liczba użytych linków w tweetach.\nz grafa zobaczymy też jak duże są grupy hunwejbinów poszczególnych serwisów, oraz takich, którzy publikują linki do różnych serwisów. No to zobaczmy pierwszy z grafów:\n\nWielkość reprezentuje całkowitą liczbę linków do artykułów serwisu, jakie opublikowali użytkownicy Twittera. Pamiętajmy, że w tych danych nie ma retweetów. Jeśli chodzi o statystykę linków to przedstawia się ona następująco:\ndomena\nn\nwww.tvp.info\n625\nwiadomosci.onet.pl\n539\nwyborcza.pl\n288\nwiadomosci.gazeta.pl\n227\nwiadomosci.wp.pl\n190\nfakty.interia.pl\n183\nwww.fakt.pl\n125\ntvn24.pl\n111\nwww.se.pl\n40\nwiadomosci.radiozet.pl\n35\nWidać wyraźnie dominację dwóch serwisów: TVP-Info i Wiadomości Onetu. Liczba artykułów z tych dwóch serwisów, ponad dwukrotnie przekracza sumę artykułów z pozostałych 8 stron. Drugi wniosek, dość oczywisty to że każdy z serwisów ma sporą grupkę wiernych i zamkniętych w informacyjnej bańce użytkowników. To te otoczki z punkcików wokół serwisu. Każdy punkt to publikacja co najmniej jednego artykułu z domeny serwisu. Interesującym elementem są konta, które znajdują się najczęściej między serwisami, a które z tymi ostatnimi łączą linie (fachowo zwane krawędziami) o kolorze takim samym jak kolor kółka serwisu. To te konta, które opublikowały linki do dwóch, czy większej liczby serwisów. Mogą to być różne przypadki np. konta symetrystów, którzy starając się być obiektywni, linkują do różnych punktów widzenia. Mogą to być też konta zwolenników rządu czy opozycji, którzy popularyzują artykuły z jednego serwisu i krytykują z innego. Aby to wyjaśnić potrzebna byłaby głębsza analiza, zapewne z sentymentem, czego na pewno dzisiaj nie będę robił. Rzuca się w oczy, co jest zresztą oczywiste dla grafów, że widać wyraźnie trzy części:\nna samej górze, samotny serwis TVP-Info\npośrodku cztery: wiadomości WP, Fakty Interii, Fakt.pl i SE.pl\nna dole cztery: Wiadomości Onet, wyborcza.pl, wiadomości Gazeta.pl, TVN24 i RadioZet.\nSamo się nasuwa, że to podział na serwisy, które preferują konserwatyści (u góry), symetryści (w centrum) i liberałowie i lewica (na dole). Widać też, że symetryści bardziej ciążą ku dołowi (lewicy i liberałom) niż ku prawicy (więcej krawędzi prowadzi z serwisóW “symetrystycznych” do liberałów i lewicy niż do konserwatystów). Oczywiście to jedynie spostrzeżenia i by przekonać się, że rzeczywiście tak jest potrzebna jest głębsza analiza.\nDrugi graf jest również bardzo ciekawy, bo przedstawia dwie rzeczy:\nświat dziennikarski był żywo zainteresowany sprawą dotacji do TVP oraz\ndziennikarze właściwie podzielili się na dwa obozy, z których ten sprzyjający liberałom, wydaje się większy.\nTen przechył w stronę liberalną widać gołym okiem na Twitterze ale by dokładnie zbadać to zjawisko, potrzebne są dane z więcej niż dwóch dni. Traktujmy więc to, co poniżej trochę z rezerwą. Zanim jednak przejdziemy do grafa, to kilka słów o tym jakie dane wykorzystałem do analizy. Jak pisałem wcześniej, wszystkie dane zbierane były w okresie 7-8 marca 2020. Do analizy dziennikarzy pobrałem z API Twittera tylko tweety dziennikarzy (na bazie mojej listy ponad 1400 dziennikarzy), które UWAGA zawierały wspomnienia jakiegokolwiek konta na Twitterze. Chodziło mi o to, by zebrać tweety w których dziennikarze odpowiadali czy komentowali czyjś tweet, albo wspominali konto. Podobnie jak wcześniej wyeliminowałem retweety, bo niewiele wnoszą do takiej analizy.\nNa podstawie tych danych utworzyłem trzy grafy. W pierwszym wielkość kółka prezentuje “wpływ” konta na innych aktorów w sieci (badanej sieci, a nie w Internecie :-), w danym okresie czasu. Fachowo nazywa się to Eigenvector Centrality i zwany jest też miarą prestiżu. Przyjmuje wartości od 0 do 1, więc arbitralnie przyjąłem, że konta, dla których ten wskaźnik wynosi co najmniej 0,50 za wpływowe, a więc widzimy ich nazwy. UWAGA 2, wpływowymi mogą być konta zarówno dziennikarzy, jak i innych, których dziennikarze wspomnieli. No to popatrzmy na te prestiżowe konta :-)\n\nZaskoczyło mnie, że konto Jacka Kurskiego, który przecież był ważnym aktorem wydarzeń, nie jest tak ważne w tej konkretnej sieci. Znaczy to oczywiście, że rzadziej niż innych go wspominano czy generalnie używano jego konta czy wspominano jego tweety. Zaskakująca jest też mizerna liczba kont, powszechnie kojarzonych z obozem konserwatywnym, a z drugiej strony spora liczba kont ewidentnie popierających liberałów czy lewicę. No i niewielu uważanych za symetrystów! To ewidentny sygnał, że mainstream przesunął się w kierunku liberalnym. Spora część z tych kont jest nazwijmy to eufemistycznie “dość krytyczna” wobec rządu czy partii rządzącej. Kolory kont prezentują grupy (plemiona), ale nie przypisywałbym im jakiś jednoznacznych konotacji politycznych, bo są to dane tylko z dwóch dni, a poza tym do klasyfikacji potrzebne jest więcej wskaźników. Niewątpliwie jednak, jak ktoś się uprze i zna środowisko dziennikarskie na Twitterze, to zauważy, że niektóre konta dziwnym trafem są w… jednej grupie. Bez względu jednak czy uznamy te grupy za plemiona, to widać ewidentnie dwie rzeczy: większość wpływowych kont raczej zaliczyć można do osób o poglądach liberalnych, trochę mniej lewicowych. Kont o poglądach prawicowych jest kilka. Pocieszające jest to, że wśród kont wpływowych nie ma osób wyrażających w sposób jednoznaczny swoje poglądy, jak np. Tomasz Lis.\nW kolejnym grafie zbadałem, o których kontach najczęściej wspominano w tweetach dziennikarzy.\n\nZdecydowanie najczęściej wspominanym kontem przez dziennikarzy, było prywatne konto Prezydenta Andrzeja Dudy. Zważywszy na to co się działo, to specjalnie mnie to nie dziwi. Co natomiast jest zaskakujące, to to, że w tym grafie pojawiają się konta osób, których w poprzednim (wpływowych) nie było. Na przykład wspomniany wcześniej Tomasz Lis czy Rafał Ziemkiewicz - oboje raczej nie bawiących się w konwenanse. Więcej jest też kont prawej strony, oraz kont mediów. Co trochę zaskakujące, to brak…konta Onetu. Po lewej stronie grafu jest grupa kont związanych ze sportem. To jedyna grupa tematyczna, którą można wydzielić z kont dziennikarskich. Gdzieś zniknęły występujące wcześniej konta dziennikarzy ekonomicznych, czy np. ze Śląska.\nOstatni graf, to odwrócenie poprzedniego, czyli konta dziennikarzy, które najwięcej tweetowały i wspominały inne konta. Tu jakiś rewelacji nie widzę. Po prostu to są najaktywniejsi dziennikarze na polskim Twitterze.\n\nReasumując, to co powyżej to zaledwie ułamek informacji, które można wyciągnąć analizując tweety z linkami do artykułów, oraz tweety wysłane przez np. dziennikarzy. Dane oraz ich wstępne przygotowanie zrobiłem w R, a grafy w Gephi. Postaram się w następnym poście, pokazać cały proces.\nJakieś uwagi, komcie? Zapraszam na dole, albo na Twitterze [@Dziennikarz](https://twietter.com/dziennikarz)\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-30T17:45:56+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2005-04-26-owsiak-zrzek-si-wiktora/",
    "title": "Owsiak zrzekł‚ się Wiktora",
    "description": "...",
    "author": [
      {
        "name": "Staś",
        "url": {}
      }
    ],
    "date": "2005-04-26",
    "categories": [],
    "contents": "\nJerzy Owsiak zrzekł się otrzymanych nagród Wiktora. W liście do pomysłodawcy nagrody, dziennikarza Józefa Węgrzyna, Owsiak napisał, że Wiktory stały się “instytucją wzajemnej adoracji” i są od lat przyznawane w tym samym gronie - źr. IAR, PAP - - - -\nW jednym z Owsiakiem zgodzić się należy, że Wiktory cały czas dostają te same osoby. Myślę, że w następnych latach lista nominowanych i nagrodzonych wyglądać będzie tak:\nWiktory za …… (wpisz rok)\nNominowani: Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Tomasz Lis\nWiktory za …… (wpisz rok)\nNominowani\nTomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Kamil Durczok\nWiecej\nWiktory za …… (wpisz rok)\nNominowani Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Justyna Pohanke\nWiktory za …… (wpisz rok) Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Monika Olejnik\nWiktory za …… (wpisz rok) Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Tomasz Lis\nNominowani\nWiktory za …… (wpisz rok) Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Kamil Durczok\nWiktory za …… (wpisz rok) Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Justyna Pohanke\nWiktory za …… (wpisz rok) Tomasz Lis Kamil Durczok Justyna Pohanke Monika Olejnik\nWiktor dla: Monika Olejnik\nNominowani … i tak do konca świata a nawet jeden dzien dłużej :-)\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-17T21:31:14+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2005-04-26-scrapbook-i-moesz-wicej/",
    "title": "Scrapbook i możesz więcej",
    "description": {},
    "author": [
      {
        "name": "SMS",
        "url": {}
      }
    ],
    "date": "2005-04-26",
    "categories": [],
    "contents": "\nScrapbook to jest to, czego mi brakowało. Ta niewielka wtyczka do Firefoksa pozwala zapamiętywać i katalogować w sposób podobny jak w Zakładkach różne materiały znalezione w sieci. Celowo pisze “różne materiały”, bo Scrapbook potrafi zapamiętać całą stronę lub tylko jej fragment. Można również zapisać jedynie link na oglądanej stronie czy zdjęcie z podpisem. Zaletą Scrapbooka jest to, że zawarte w nim strony można je katalogować, a foldery w których się znajdują przeszukiwać. Każda pozycja może też zawierać notatki. Uprzedzając pytanie: Scrapbook jest zdecydowanie lepszy - a właściwie trzeba powiedzieć - inny niż popularne Zakładki. W Zakładkach zapamiętujemy jedynie linki do stron, w Scrapbook zaróno link jak i całą zawartość strony lub odwrotnie - tylko jej fragment.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-30T15:56:49+01:00",
    "input_file": {}
  }
]
